<?xml version="1.0" ?>
<net name="saved_model" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1,64,64,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_1"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,input_1,input_1:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_1/Transpose([0 3 1 2])/value34954633" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_1/Transpose([0 3 1 2])/value34954633"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_1/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="input_1/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="32" size="1728"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_1/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/model_1/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_2704" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="1760" size="64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_2704"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/model_1/activation_1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/activation_1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_1/activation_1/Relu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 16, 3, 3" offset="1824" size="73728"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_2/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/model_1/conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_2/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_27072712" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="75552" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_27072712"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model_1/activation_2/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/activation_2/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_1/activation_2/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/model_1/conv2d_3/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="76064" size="589824"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_3/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_3/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/model_1/conv2d_3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_3/Conv2D:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/model_1/conv2d_4/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="128, 16, 1, 1" offset="665888" size="8192"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_4/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_4/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model_1/conv2d_4/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_4/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_4/Conv2D:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model_1/add_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/add_1/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/add_1/add:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_mul_27142718" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="674080" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_mul_27142718"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/mean/Fused_Mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="data_add_27152720" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="674592" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_27152720"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model_1/activation_3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/activation_3/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_1/activation_3/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="675104" size="589824"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_5/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/model_1/conv2d_5/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_5/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="data_add_27232728" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1264928" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_27232728"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/model_1/activation_4/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/activation_4/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_1/activation_4/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/model_1/conv2d_6/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="1265440" size="589824"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_6/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_6/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/model_1/conv2d_6/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_6/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_6/Conv2D:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/model_1/add_2/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/add_2/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/add_2/add:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_mul_27302734" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1855264" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_mul_27302734"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/mean/Fused_Mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="data_add_27312736" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1855776" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_27312736"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/model_1/activation_5/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/activation_5/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_1/activation_5/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/model_1/batch_normalization_6/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="1856288" size="1179648"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_6/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_7/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/model_1/conv2d_7/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_7/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_27392744" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="3035936" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_27392744"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/model_1/batch_normalization_6/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_6/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/batch_normalization_6/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/model_1/activation_6/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/activation_6/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_1/activation_6/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/model_1/conv2d_8/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 3, 3" offset="3036960" size="2359296"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_8/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_8/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/model_1/conv2d_8/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_8/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_8/Conv2D:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/model_1/conv2d_9/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 1, 1" offset="5396256" size="131072"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_9/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_9/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/model_1/conv2d_9/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_9/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_9/Conv2D:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/model_1/add_3/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/add_3/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/add_3/add:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="data_mul_27462750" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="5527328" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_mul_27462750"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/model_1/batch_normalization_7/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_7/FusedBatchNormV3/mean/Fused_Mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="data_add_27472752" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="5528352" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_27472752"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/model_1/batch_normalization_7/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_7/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/batch_normalization_7/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/model_1/activation_7/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/activation_7/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_1/activation_7/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/model_1/batch_normalization_8/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 3, 3" offset="5529376" size="2359296"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_8/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_10/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/model_1/conv2d_10/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_10/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_add_27552760" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="7888672" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_27552760"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/model_1/batch_normalization_8/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_8/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/batch_normalization_8/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/model_1/activation_8/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/activation_8/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_1/activation_8/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/model_1/conv2d_11/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 3, 3" offset="7889696" size="2359296"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_11/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_11/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/model_1/conv2d_11/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_11/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_11/Conv2D:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/model_1/add_4/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/add_4/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/add_4/add:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="data_mul_27622766" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="10248992" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_mul_27622766"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/model_1/batch_normalization_9/FusedBatchNormV3/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_9/FusedBatchNormV3/mean/Fused_Mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="data_add_27632768" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="10250016" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_27632768"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/model_1/batch_normalization_9/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_9/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/batch_normalization_9/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/model_1/activation_9/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/activation_9/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_1/activation_9/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/model_1/batch_normalization_10/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 3, 3" offset="10251040" size="4718592"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_10/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_12/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/model_1/conv2d_12/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_12/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="data_add_27712776" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="14969632" size="2048"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_27712776"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/model_1/batch_normalization_10/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/batch_normalization_10/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/batch_normalization_10/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/model_1/activation_10/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/activation_10/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_1/activation_10/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/model_1/conv2d_13/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 3, 3" offset="14971680" size="9437184"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_13/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_13/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/model_1/conv2d_13/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_13/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_13/Conv2D:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/model_1/conv2d_14/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 1, 1" offset="24408864" size="524288"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_14/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_14/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/model_1/conv2d_14/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/conv2d_14/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/conv2d_14/Conv2D:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/model_1/add_5/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_1/add_5/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/add_5/add:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="data_mul_27782782" type="Const" version="opset1">
